programmingTutorial07/programmingTutorial07/testCase/002-myFunctionObject/cavity/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     icoFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         0.5;

deltaT          0.005;

writeControl    timeStep;

writeInterval   20;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;


functions
{
	
forces
{
    type        myFunctionObject;

    functionObjectLibs ( "libmyFunctionObject.so" );

    outputControl   timeStep;
    timeInterval    1;

    log         yes;

    patches     (movingWall);
    pName       p;
    UName       U;
    rhoName     rhoInf;     // Indicates incompressible
    log         true;
    rhoInf      1;          // Redundant for incompressible

    CofR        (0 0 0);    
}

}
// ************************************************************************* //
